tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "axel"
brew "bat"
brew "cmake"
brew "eza"
brew "fd"
brew "ghq"
brew "git"
brew "jq"
brew "k3d"
brew "k9s"
brew "kubernetes-cli"
brew "lua"
brew "make"
brew "mtr"
brew "neovim"
brew "nkf"
brew "pass"
brew "procs"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "sheldon"
brew "starship"
brew "tig"
brew "tmux"
brew "wakeonlan"
brew "wget"
brew "zsh"
cask "ghostty"
cask "discord"
cask "font-hackgen-nerd"
cask "google-chrome"
cask "google-japanese-ime"
cask "messenger"
cask "slack"
cask "tailscale"
cask "visual-studio-code"
cask "zoom"
