tap "domt4/autoupdate"
tap "dwarvesf/tap"
tap "fossas/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "vdaas/valdcli"
brew "axel"
brew "bat"
brew "xz"
brew "cmake"
brew "direnv"
brew "exa"
brew "fd"
brew "font-util"
brew "gcc"
brew "ghq"
brew "git"
brew "git-delta"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "helm"
brew "hub"
brew "hugo"
brew "jq"
brew "k3d"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "make"
brew "mariadb"
brew "mas"
brew "mtr"
brew "n"
brew "ncurses"
brew "neovim"
brew "nmap"
brew "pass"
brew "procs"
brew "rclone"
brew "ripgrep"
brew "speedtest-cli"
brew "starship"
brew "stern"
brew "telnet"
brew "tig"
brew "tmux"
brew "wget"
brew "yarn"
brew "zsh"
brew "vdaas/valdcli/valdcli"
cask "alacritty"
cask "android-platform-tools"
cask "android-sdk"
cask "android-studio"
cask "boostnote"
cask "ccleaner"
cask "cyberduck"
cask "discord"
cask "figma"
cask "font-fira-code-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-noto-emoji"
cask "fuse"
cask "google-chrome-beta"
cask "google-cloud-sdk"
cask "google-japanese-ime-dev"
cask "kindle-previewer"
cask "ngrok"
cask "osxfuse"
cask "vimmotion"
cask "visual-studio-code"
cask "zoom"
