tap "domt4/autoupdate"
tap "fossas/tap"
tap "goodwithtech/dockle"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "vdaas/valdcli"
brew "axel"
brew "bat"
brew "xz"
brew "cmake"
brew "exa"
brew "ghq"
brew "git"
brew "git-delta"
brew "go"
brew "graphviz"
brew "helm"
brew "hub"
brew "hugo"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "mas"
brew "ncurses"
brew "neovim"
brew "nmap"
brew "node"
brew "procs"
brew "rclone"
brew "ripgrep"
brew "speedtest-cli"
brew "starship"
brew "stern"
brew "telnet"
brew "tig"
brew "tmux"
brew "wget"
brew "zsh"
brew "vdaas/valdcli/valdcli"
cask "android-platform-tools"
cask "android-sdk"
cask "android-studio"
cask "boostnote"
cask "ccleaner"
cask "cyberduck"
cask "discord"
cask "docker-edge"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "google-cloud-sdk"
cask "google-japanese-ime-dev"
cask "krisp"
cask "zoom"
cask "vivaldi"
