autotiling
azote
bluetooth-support
btrfs-assistant
ccache-ext
chaotic-keyring
chaotic-mirrorlist
clipman
docker-credential-pass
downgrade
fcitx5-input-support
fcitx5-mozc-ut
fcitx5-skin-arc
firedragon
garuda-assistant
garuda-boot-options
garuda-browser-settings
garuda-common-settings
garuda-dracut-support
garuda-fish-config
garuda-gamer
garuda-hooks
garuda-hotfixes
garuda-icons
garuda-network-assistant
garuda-settings-manager
garuda-setup-assistant
garuda-sway-settings
garuda-system-maintenance
garuda-video-linux-config
garuda-wallpapers
garuda-welcome
garuda-zsh-config
gestures
ghq
google-chrome-beta
greetd-qtgreet
grub-garuda
grub-theme-garuda
gstreamer-meta
input-devices-support
kvantum-theme-nordic-git
milcheck
mozc-ut
netrc
networkmanager-support
nordic-darker-theme
nwg-drawer
nwg-launchers
nwg-look
os-prober-btrfs
otf-font-awesome-4
pace
paru
pipewire-support
popsicle
rate-mirrors
reflector-simple
rate-mirrors-bin
slack-desktop
snapper-support
snapper-tools
swayr
tela-circle-icon-theme-git
ttf-hackgen
update-grub
wdisplays
wlrobs-hg
wlsunset
wob
zoom
