docker-buildx-git
docker-credential-pass-git
downgrade
duf-git
ethtool-git
fcitx5-mozc-ut
fcitx5-skin-arc
ghq-bin
google-chrome-beta
google-cloud-cli
google-cloud-cli-gke-gcloud-auth-plugin
gopreload-git
light
meson-git
milcheck
mkinitcpio-firmware
netrc
ngrok
nkf-git
noto-fonts-emoji-git
pakku
paru-bin
rate-mirrors-bin
rmlint
slack-desktop
swaybg-git
sway-git-wlroots-git
tpacpi-bat-git
ttf-hackgen
wdisplays-git
wlroots-hidpi-xprop-git
zoom
