acpi
alacritty
alsa-utils
axel
ccache
chrony
clang
cmake
discord
dmidecode
dnsmasq
docker
docker-buildx-git
docker-credential-pass-git
downgrade
duf-git
ethtool-git
fastfetch
fcitx5
fcitx5-configtool
fcitx5-gtk
fcitx5-mozc-ut
fcitx5-skin-arc
fd
fwupd
fwupd-efi
ghq-bin
git
git-delta
go
google-chrome-beta
google-cloud-cli
google-cloud-cli-gke-gcloud-auth-plugin
gopreload-git
grim
htop
intel-ucode
iwd
kanshi
kitty
kubectl
kubectx
libnm
light
linux-zen
linux-zen-headers
lsd
lshw
lsof
mako
milcheck
mkinitcpio-firmware
mpv
mtr
neovim
netrc
networkmanager
ngrok
nkf-git
nmap
noto-fonts-emoji-git
pacman-contrib
pakku
paru-bin
pass
pavucontrol
pipewire
powertop
procs
profile-sync-daemon
psensor
pulseaudio-alsa
ranger
rate-mirrors-bin
rclone
rebuild-detector
ripgrep
rmlint
seatd
sheldon
slack-desktop
slurp
smartmontools
starship
swaybg-git
sway-git-wlroots-git
tailscale
tig
tlp
tmux
tpacpi-bat-git
ttf-hackgen
udisks2
ufw
unrar
unzip
wakeonlan
waybar
wayland
wdisplays-git
whois
wl-clipboard
wlroots-hidpi-xprop-git
wofi
wpscan
xf86-input-synaptics
xorg-xwayland
yarn
zoom
zsh
