acpi
acpi_call-dkms
alacritty
alsa-utils
amd-ucode
archlinux-keyring
autoconf
automake
avr-binutils
avrdude
avr-gcc
avr-gdb
avr-libc
axel
base-devel
bash-language-server
ccache
chrome-remote-desktop
chrony
clang
cmake
cuda
discord
dmidecode
dnsmasq
docker
docker-credential-pass-git
dosfstools
downgrade
duf-git
ethtool
fakeroot
fanctl-git
fastfetch
fcitx5
fcitx5-configtool
fcitx5-gtk
fcitx5-mozc-ut
fcitx5-skin-arc
fd
fwupd
fwupd-efi
gettext
ghq-bin
git
git-delta
go
google-chrome-beta
google-cloud-cli
google-cloud-cli-gke-gcloud-auth-plugin
gopreload-git
graphviz
grep
grim
gzip
helvum
htop
imagemagick
inetutils
iptables-nft
kanshi
kubectl
kubectx
less
libnm
light
linux-firmware
linux-zen
linux-zen-headers
lsd
lshw
make
mako
mdadm
mesa
milcheck
mkinitcpio-firmware
mpv
mtr
mysql-workbench
neovim
netrc
networkmanager
ngrok
nmap
noto-fonts-emoji-git
nvidia-open-dkms
nvidia-settings
nvidia-utils
nvme-cli
openssl-1.1
pacman-contrib
pakku
parted
paru-bin
pass
patch
pavucontrol
pipewire
pkgconf
powertop
procs
profile-sync-daemon
psensor
pulseaudio-alsa
ranger
rate-mirrors-bin
rclone
ripgrep
rmlint
seatd
sed
sheldon
slack-desktop
slurp
smartmontools
starship
sudo
swaybg-git
sway-git
sysbench
sysfsutils
systemd
systemd-sysvcompat
tailscale
tar
thefuck
thunderbolt-utils
tig
tmux
ttf-hackgen
udisks2
ufw
unrar
unzip
usbutils
vulkan-mesa-layers
waybar
wayland
wdisplays-git
which
whois
wl-clipboard
wofi
wol
wpscan
xf86-video-nouveau
xfsprogs
xorg-xwayland
yarn
yt-dlp
zoom
zsh
