acpi
acpi_call-dkms
alacritty
alsa-utils
amd-ucode
archlinux-keyring
atuin-git
autoconf
automake
avr-binutils
avrdude
avr-gcc
avr-gdb
avr-libc
axel
base-devel
bash-language-server
bottom
btop
btop-theme-catppuccin
bun-bin
ccache
chrony
clang
claude-code-bin
cmake
cuda
discord
dmidecode
dnsmasq
docker
docker-buildx
docker-credential-pass-git
dosfstools
downgrade
duf-git
egl-gbm
egl-wayland
egl-x11
ethtool-git
fakeroot
fanctl-git
fastfetch
fcitx5
fcitx5-configtool
fcitx5-gtk
fcitx5-mozc-ut-full
fcitx5-skin-arc
fd
fwupd
fwupd-efi
gettext
ggshield
ghostty-x86_64-v3-git
ghq
git
git-delta
gitui
go
google-chrome-beta
google-cloud-cli
google-cloud-cli-gke-gcloud-auth-plugin
gopreload-git
graphviz
grep
grim
gzip
helix
helvum
htop
imagemagick
inetutils
iptables
irqbalance
kanshi
kubectl
kubectx
less
libnm
libva-nvidia-driver
libva-utils
light
linux-firmware
linux-zen
linux-zen-headers
lsd
lshw
make
mako
mdadm
mesa
milcheck
mozc-ut-full-common
mpv
mtr
mysql-workbench
netrc
networkmanager
ngrok
nkf-git
nmap
noto-fonts-emoji-git
nvidia-beta-dkms
nvidia-container-toolkit
nvidia-settings-beta
nvidia-utils-beta
nvme-cli
opencl-nvidia-beta
openssl-1.1
pacman-contrib
pacman-static
pakku
parted
paru
pass
patch
pavucontrol
pipewire
pipewire-alsa
pipewire-pulse
pkgconf
powertop
prmt
procs
profile-sync-daemon
psensor
pulseaudio-alsa
rancher-k3d-beta-bin
ranger
rate-mirrors-bin
rclone
rebuild-detector
reflector
ripgrep
rmlint
seatd
sed
sheldon
slack-desktop
slurp
smartmontools
starship
sudo
swaybg-git
sway-git-wlroots-git
sysbench
sysfsutils
systemd
systemd-sysvcompat
tailscale
talosctl-bin
tar
thefuck
tig
tmux
ttf-hackgen
udisks2
ufw
unrar
unzip
usbutils
vulkan-mesa-layers
wakeonlan
waybar
wayland
wdisplays-git
which
whois
wireless-regdb
wl-clipboard
wlroots-hidpi-xprop-git
wofi
wpscan-git
xdg-desktop-portal-wlr
xfsprogs
xorg-xwayland
yt-dlp
zoom
zoxide
zsa-keymapp-bin
zsh
zsh-patina-bin
