btop-theme-catppuccin
bun-bin
chrome-remote-desktop
docker-credential-pass-git
downgrade
duf-git
ethtool-git
fanctl-git
fcitx5-skin-arc
ggshield
ghq-bin
google-chrome-beta
google-cloud-cli
google-cloud-cli-gke-gcloud-auth-plugin
gopreload-git
light
milcheck
neovim-git
netrc
ngrok
nkf-git
noto-fonts-emoji-git
nvidia-beta-dkms
nvidia-settings-beta
opencl-nvidia-beta
pakku
paru-bin
rancher-k3d-beta-bin
rate-mirrors-bin
rmlint
slack-desktop
swaybg-git
sway-git-wlroots-git
talosctl-bin
thunderbolt-utils
ttf-hackgen
wdisplays-git
wlroots-hidpi-xprop-git
wpscan-git
zoom
zsa-keymapp-bin
