acpi
acpi_call-dkms
alacritty
alsa-utils
android-tools
archlinux-keyring
autoconf
automake
avr-binutils
avr-gcc
avr-gdb
avr-libc
avrdude
axel
bash-language-server
bbswitch-dkms
bluez-firmware
bluez-utils
caprine
ccache
chrome-remote-desktop
chromedriver-beta
chrony
clang
cmake
code
deno
discord
dnsmasq
docker
docker-credential-pass-bin
dosfstools
downgrade
dropbear
duf
exa
fakeroot
fcitx5
fcitx5-configtool
fcitx5-mozc
fcitx5-skin-arc
fd
fwupd
geekbench
gettext
ghq
git
git-delta
gnome-keyring
go
google-chrome-beta
google-cloud-sdk
gopls
gopreload-git
graphviz
grep
grim
gzip
htop
imagemagick
imv
inetutils
intel-ucode
iptables-nft
iwd
kubectl
less
libnm-iwd
light
linux-firmware
linux-zen
linux-zen-headers
lshw
lsof
make
mako
mdadm
mesa
milcheck
mpv
mtr
mysql-workbench
neofetch
neovim
networkmanager-iwd
ngrok
nmap
noto-fonts-emoji
npm
nvidia-dkms
nvidia-prime
nvidia-settings
nvme-cli
openssh
optimus-manager
pacman-contrib
parted
pass
patch
pavucontrol
pkgconf
powertop
prime
procs
profile-sync-daemon
pulseaudio
pulseaudio-alsa
pulseaudio-bluetooth
ranger
rclone
ripgrep
rmlint
scaramanga
sed
simplescreenrecorder-wlroots-git
slack-desktop
slurp
smartmontools
starship
stern
sudo
sway
sysfsutils
systemd
systemd-boot-pacman-hook
systemd-sysvcompat
tailscale
tar
thefuck
tig
tinygo
tlp
tlp-rdw
tmux
tmux-xpanes
tpacpi-bat-git
tracktion-waveform
ttf-hackgen
tzupdate
udisks2
ufw
unrar
unzip
usbutils
waybar
wayland
wdisplays
wget
which
whois
wl-clipboard
wlc
wofi
wpscan
xf86-input-synaptics
xfsprogs
xorg-xwayland
yarn
yay-bin
youtube-dl
zoom
zsh
