acpi
acpi_call-dkms
alacritty
android-tools
avr-binutils
avr-gcc
avr-gdb
avr-libc
avrdude
axel
bash-language-server
bbswitch-dkms
bluez-firmware
caprine
ccache
chrome-remote-desktop
chromedriver-beta
chrony
code
deno
discord
docker
docker-credential-pass-bin
downgrade
dropbear
duf
exa
fcitx5
fcitx5-configtool
fcitx5-mozc
fcitx5-skin-arc
fd
fwupd
geekbench
ghq
git-delta
go
google-chrome-beta
google-cloud-sdk
gopls
gopreload-git
grim
imv
iwd
kubectl
libnm-iwd
light
lshw
mako
milcheck
mpv
mysql-workbench
neofetch
neovim
networkmanager-iwd
ngrok
npm
nvme-cli
optimus-manager
pacman-contrib
pass
powertop
prime
procs
profile-sync-daemon
ranger
rclone
ripgrep
rmlint
scaramanga
simplescreenrecorder-wlroots-git
slack-desktop
slurp
starship
stern
sway
systemd-boot-pacman-hook
tailscale
thefuck
tig
tinygo
tlp
tlp-rdw
tmux
tmux-xpanes
tpacpi-bat-git
tracktion-waveform
ttf-hackgen
tzupdate
ufw
waybar
wdisplays
wl-clipboard
wlc
wofi
wpscan
yarn
yay-bin
youtube-dl
zoom
