bbswitch-zen
bluez-firmware
boostnote-bin
chrome-remote-desktop
chromedriver-beta
docker-credential-pass-bin
downgrade
fcitx5-skin-arc
geekbench
ghq
goland
google-chrome-beta
google-cloud-sdk
gopreload-git
intelmetool-git
iwd-git
kubectl-bin
libnm-iwd
linux-firmware-iwlwifi-git
milcheck-bin
networkmanager-iwd
ngrok
optimus-manager
prime
scaramanga
simplescreenrecorder-wlroots-git
slack-desktop
systemd-boot-pacman-hook
tmux-xpanes
tpacpi-bat-git
tracktion-waveform
ttf-hackgen-nerd
tzupdate
wdisplays
yay-bin
zoom
